# FamilyUsagePseudoParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyUsagePseudoParam Property
ParameterTypeId Class See Also
---
"Usage"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyUsagePseudoParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyUsagePseudoParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyUsagePseudoParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace